final class OAuth2Service {
    static let shared = OAuth2Service()
    private init() {}
    
//  Добавьте функцию, которая создаст URLRequest для получения авторизационного
//  токена с помощью аргумента метода code и константных параметров. Используйте
//  безопасные способы извлечения опциональных значений.
    
    
//  Добавьте функцию fetchOAuthToken с входным параметром code.
    
//  Добавьте в её реализацию создание URLRequest с помощью подготовленного метода и выполните запрос с помощью URLSession.shared.dataTask.
}

